type classifyDefType = {
  [main: string]: {
    sub: string[]
  }
}

export const classifyDef: classifyDefType = {
  "タケルライコex": {
    sub: ["オーガポン みどりのめんex", "スナノケガワex"]
  },
  "リザードンex": {
    sub: ["ヨルノズク", "ピジョットex",]
  },
  "ドラパルトex": {
    sub: ["ネイティオ", "ピジョットex", "ヨノワール", "リザードンex",]
  },
  "サーナイトex": {
    sub: ["ジュペッタex"]
  },
  "トドロクツキex": {
    sub: []
  },
  "テツノイバラex": {
    sub: ["ドラパルトex"]
  },
  "ソウブレイズex": {
    sub: []
  },
  "サーフゴーex": {
    sub: ["ドラパルトex"]
  },
  "ミライドンex": {
    sub: []
  },
  "イダイナキバ": {
    sub: []
  },
  "パオジアンex": {
    sub: ["セグレイブ"]
  },
  "ゲッコウガex": {
    sub: []
  },
  "トドロクツキ": {
    sub: ["ハバタクカミ"]
  },
  "テラパゴスex": {
    sub: ["ヨノワール"]
  },
  "サザンドラex": {
    sub: ["ピジョットex"]
  },
  "ピカチュウex": {
    sub: ["レアコイル", "ハピナスex"]
  },
  "ブリジュラスex": {
    sub: ["ホップのザシアンex"]
  },
  "ガケガニ": {
    sub: []
  },
  "ナンジャモのハラバリーex": {
    sub: ["ナンジャモのタイカイデン"]
  },
  "ヤドキング": {
    sub: []
  },
  "オーダイル": {
    sub: []
  },
  "Nのゾロアークex": {
    sub: []
  },
  "リーリエのピッピex": {
    sub: ["オーガポン みどりのめんex"]
  },
  "ミロカロスex": {
    sub: []
  },
  "ホップのザシアンex": {
    sub: ["メタング", "ホップのカビゴン"]
  },
  "バンギラス": {
    sub: []
  },
  "ブースターex": {
    sub: []
  }
}
