type classifyDefType = {
  [main: string]: {
    sub: string[]
  }
}

export const classifyDef: classifyDefType = {
  "タケルライコex": {
    sub: ["オーガポン みどりのめんex", "スナノケガワex"]
  },
  "リザードンex": {
    sub: ["ピジョットex", "ビーダル"]
  },
  "ドラパルトex": {
    sub: ["ネイティオ", "ピジョットex", "ヨノワール", "リザードンex", "キュワワー"]
  },
  "サーナイトex": {
    sub: []
  },
  "ルギアVSTAR": {
    sub: ["アーケオス"]
  },
  "レジドラゴVSTAR": {
    sub: ["オーガポン みどりのめんex", "アルセウスVSTAR"]
  },
  "トドロクツキex": {
    sub: []
  },
  "テツノイバラex": {
    sub: []
  },
  "オリジンパルキアVSTAR": {
    sub: ["ヨノワール", "ヨルノズク"]
  },
  "ソウブレイズex": {
    sub: ["オリジンパルキアVSTAR"]
  },
  "カビゴン": {
    sub: []
  },
  "サーフゴーex": {
    sub: ["オリジンパルキアVSTAR",]
  },
  "キュワワー": {
    sub: ["かがやくゲッコウガ", "かがやくリザードン"]
  },
  "ミライドンex": {
    sub: []
  },
  "イダイナキバ": {
    sub: []
  },
  "パオジアンex": {
    sub: ["セグレイブ"]
  },
  "オリジンディアルガVSTAR": {
    sub: ["メタング"]
  },
  "ギラティナVSTAR": {
    sub: ["キュワワー"]
  },
  "ゲッコウガex": {
    sub: []
  },
  "アルセウスVSTAR": {
    sub: ["ギラティナVSTAR"]
  },
  "トドロクツキ": {
    sub: ["ハバタクカミ"]
  },
  "ヒスイゾロアークVSTAR": {
    sub: []
  },
  "テラパゴスex": {
    sub: ["ヨノワール"]
  },
  "サザンドラex": {
    sub: ["ピジョットex"]
  },
  "ピカチュウex": {
    sub: ["レアコイル"]
  },
  "ブリジュラスex": {
    sub: []
  },
  "ガケガニ": {
    sub: []
  },
}
